# GetGBXMLDocumentId Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportUtils..::..GetGBXMLDocumentId Method
ExportUtils Class See Also
---
Retrieves the GUID representing this document in exported gbXML files.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public static Guid GetGBXMLDocumentId(
	Document document
)
```

Visual Basic
---
```text
Public Shared Function GetGBXMLDocumentId ( _
	document As Document _
) As Guid
```

Visual C++
---
```text
public:
static Guid GetGBXMLDocumentId(
	Document^ document
)
```

# ### Parameters
document
    Type: Autodesk.Revit.DB..::..Document The document.
# ### Return Value
The value of the GUID representing this document in gbXML export.
# Remarks
This id can be used to cross-reference different gbXML exports from the same document.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ExportUtils Class
Autodesk.Revit.DB Namespace